transonic-bump/setups.orig/SpalartAllmaras/0.orig/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volSymmTensorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      R;

}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0.0066666667 0 -0 0.0066666667 -0 0.0066666667);


boundaryField
{
    inlet
    {
        type calculated;
        value $internalField;
    }

    outlet
    {
	type zeroGradient;
    }
    top
    {
        type symmetry;
    }
    obstacle
    {
        //type zeroGradient;
        type kqRWallFunction;
        value $internalField;
    }

    upwall
    {
        type            symmetry;
    }

    downwall
    {
        type            symmetry;
    }

    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
