transonic-bump/setups.orig/SpalartAllmaras/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 5220.8;


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;



//        type            turbulentMixingLengthFrequencyInlet;
//        mixingLength    1.0e-5;
//        value         uniform  $omegaInlet;

//        type      fixedValue;
//        value     uniform  1224;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;

//	type zeroGradient;
    }

    top
    {
        type symmetry;
    }
    obstacle
    {
        type            omegaWallFunction;
        value           $internalField;

        //type            zeroGradient;
//        type       omegaWallFunction;
//        value      uniform 1224;
//        type            omegaWallFunction;
//        value           uniform 1e8;
    }

    upwall
    {
        type            symmetry;
    }

    downwall
    {
        type            symmetry;
    }



    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
